{
  "detail_portofolio": "This is my portfolio project after learning React.js for one month. My goal in creating this project is to test my knowledge of React.js that I have learned. The hooks I used are only useState, useEffect, and useInView, and from this project, I learned how to use useInView to create animations when elements are visible on the screen and the library I used is daisy-ui to create the sidebar.",
  "detail_my_interior": "This is one of my first projects I got from https://devchallenges.io/. In this project, I learned to use JavaScript to create a sidebar.",
  "detail_not_found": "This is my first project I got from https://devchallenges.io/. In this project, I learned to use HTML and CSS for the first time to create an attractive website layout.",
  "detail_quote": "This is the project I got from https://www.freecodecamp.org/. In this project, I learned to use APIs and how to display them.",
  "detail_my_team": "This is one of the first projects I got from https://devchallenges.io/. In this project, I learned to use CSS selectors to make the second and fifth children slightly different from the others.",
  "detail_tic_tac": "This is the tic-tac-toe game project I learned from the official React.js website. Here, I slightly modified it into several separate files unlike in the tutorial, and from this project, I learned how to connect values ​​through props between components.",
  "detail_multiselect": "Result of a simple TypeScript learning project with additional keyboard feature.",
  "detail_store": "Deeper TypeScript learning project by creating an E-commerce connected to Midtrans as a payment gateway and also connected to an admin dashboard to manage content, with Next.js as the framework.",
  "detail_admin": "An admin dashboard connected to the previous e-commerce project to manage what content to display. This project uses Clerk for authentication and Prisma as ORM and of course there is API that can be used to create E-commerce as a front-end.",
  "detail_restfull": "A RestFull API project with Java and Spring Boot as the framework, Postgres for the database, and Junit for testing. This project uses MVC as the architectural design.",
  "detail_leet": "I created this project to fetch data from LeetCode that I want to display on my portfolio. I only spent one day learning to make this project so it's still very simple.",
  "aboutme": "I am Yon, a 24-year-old web developer based in Blora. Despite graduating from a vocational school in Accounting, my true passion has always been coding. I am known for my enthusiastic and diligent pursuit of self-directed learning, and I am committed to making a significant impact in the world of web development.   ",
  "aboutme2": "My journey into coding is not just a dream, it's a dedicated commitment. I firmly believe in the power of self-taught skills and have an unwavering dedication to contributing meaningfully to the ever-evolving field of web development.",
  "contacme": "For any inquiries or just a friendly chat, don't hesitate to reach out to Yon through the contact information provided below.",
  "Contact": "Contact Me",
  "Welcome": "Welcome To My Website"
}
