{
  "detail_portofolio": "This is my portfolio project after learning React.js for one month. The purpose of creating this project was to test my knowledge of React.js that I had acquired. The hooks I used were only useState, useEffect, and useInView. From this project, I learned how to use useInView to create animations when elements are visible on the screen. I also used the daisy-ui library to create the sidebar.",
  "detail_my_interior": "This is one of the first projects I got from https://devchallenges.io/. In this project, I learned to use JavaScript to create a sidebar.",
  "detail_not_found": "This is the first project I obtained from https://devchallenges.io/. In this project, I learned to use HTML and CSS for the first time to create an appealing website layout.",
  "detail_quote": "This is a project I obtained from https://www.freecodecamp.org/. In this project, I learned how to use an API and how to display it.",
  "detail_my_team": "This is one of the first projects I received from https://devchallenges.io/. In this project, I learned to use CSS selectors to style the second and fifth children slightly differently from the others.",
  "detail_store" : "project to learn TypeScript more deeply by creating E-commerce that is connected to midtrans as a payment gateway and also connected to the admin dashboard to manage content",
  "detail_multiselect" : "the results of a simple TypeScript learning project with additional keyboard features",
  "detail_admin" : "an admin dashboard that is connected to the previous e-commerce project to regulate what content you want to display, this project uses clerk as auth and prism as ORM",
  "detail_restfull" : "a RestFull API project with Java and Springboot as the framework, Postgre for the database and Junit for testing",
  "detail_tic_tac": "This is a tic-tac-toe game project that I learned from the official React.js website. Here, I made some modifications by separating it into several separate files, unlike in the tutorial. From this project, I learned how to connect values through props between components.",
  "aboutme": "Meet Yon, a 24-year-old web developer based in Blora. Despite graduating from a vocational school in Accounting, Yon has always harbored a deep-seated passion for coding. Known for their enthusiastic and diligent pursuit of self-directed learning, Yon is committed to making a significant impact in the world of web development. ",
  "aboutme2": "Yon's journey into coding isn't just a dream, it's a dedicated commitment. Their belief in the power of self-taught skills and unwavering dedication reflects a strong desire to contribute meaningfully to the ever-evolving field of web development.",
  "contacme": "For any inquiries or just a friendly chat, don't hesitate to reach out to Yon through the contact information provided below.",
  "Contact" : "Contact Me",
  "Welcome" : "Welcome To My Website",
  "Role": " Role",
  "Magic": "Magic",
  "Magic Sequence": "Magic Sequence",
  "Witchcraft Archives": "Witchcraft Archives",
  "Weapons": "Weapons",
  "Other": "Other",
  "JavaScript" : "JavaScript (JS) magic brings the world of programming to life with the power to create websites that are not just static, but interactive and dynamic. With its magic, content dances in front of the screen, changing and moving without the need for page reloading rituals.",
  "Tailwind" : "Tailwind CSS, as the Magic Suite, gives character developers the ability to change the appearance of HTML elements quickly and accurately. With magical spells (utility classes), they are able to create stunning user interfaces, as if each utility class is magic that can be activated to shape the design to the character's liking.",
  "React" : "React, as the magic wand of JavaScript, inspires the creation of lively user interfaces, building a component-based interactive foundation. Born from the skilled hands of Facebook and materialized in open-source form, React spreads its magic to all corners of the world.",
  "Framer" : "Framer Motion, ostensibly a mysterious animation tool in the JavaScript world, offers simple yet incredible power to React. With its magical capabilities, this library creates smooth movements and dazzling beauty on the web homepage.",
  "Daisy" : "DaisyUI, like an open magic book in the design world, is designed on top of TailwindCSS. The library features short semantic classes focused on components, forming magical spells structured from longer Tailwind class strings.",
  "Vscode" : "VSCode is an agile and deadly weapon on the code battlefield. With its sharp sword, code wizards can bulldoze through lines of codification, creating powerful and efficient spells (code). In competition with similar tools, VSCode is the weapon of choice that gives code wizards the power and agility to create amazing digital worlds.",
  "Figma" : "Figma is a magical design book that allows design wizards to design and visualize visual elements with incredible freedom and precision. As a collaborative platform, Figma allows teams of design wizards to come together to bring life to creative concepts, as if each visual element were magic that the whole team could access and change.",
  "Html" : "HTML5 is a digital magic text that provides guidelines for designing and building the web world. As the latest standard for HTML, it brings new elements and capabilities that enable the creation of more dynamic, interactive, and responsive web pages.",
  "Css" : "CSS3 is the style shield of the web, providing the ability to beautify and give identity to HTML elements. As an evolution of CSS, this version brings a number of new features, such as animations, transitions, and other visual effects, making it a powerful weapon for design wizards to build beautiful and dynamic displays on the web design battlefield.",
  "Scss" : "SCSS is a magical armor that allows design wizards to create styles and layouts more efficiently in the web world. As an extension of CSS with features such as variables, mixins, and nesting, SCSS gives developers the magic ability to design and manage styles more effectively, as if each HTML element is wearing a unique and efficient magic suit.",
  "Git" : "Git is a magic notebook that allows software development wizards to track, store, and collaborate on the creation of spells (code) with incredible accuracy and precision. As a version control system, Git ensures that every magical action in the software development world is recorded and accessible, allowing teams of wizards to work together and maintain harmony in the development of their projects.",
  "Rest" : "REST API is a teleportation gateway that allows code wizards to transfer and share magic power (data) across the digital world. As an interface that provides structured access, REST APIs allow code wizards to communicate with other elements in the software development world, enabling information exchange and collaboration between systems."
}
