{
  "detail_portofolio": "ini adalah project portofolio saya setelah belajar React js selama satu bulan, Tujuan saya membuat project ini adalah meng-test pengetahuan saya tentang React js yang sudah saya pelajari. Hooks yang saya pakai hanya useState, useEfffet, dan useInView dan dari project  ini saya belajar penggunaan useInView untuk membuat animasi saat elemen terlihat di layar dan library yang saya pakai daisy-ui untuk membuat sideBar",
  "detail_my_interior": "ini adalah salah satu project  pertama saya dapat dari https://devchallenges.io/. di project ini saya belajar menggunakan JavaScript untuk membuat sidebar ",
  "detail_not_found":  "ini adalah project pertama yang saya dapat dari https://devchallenges.io/. di project ini saya belajar pertama kali menggunakan html dan css untuk membuat tampilan website yang menarik ",
  "detail_quote": "ini adalah yang saya dapat dari https://www.freecodecamp.org/. di project ini saya belajar menggunakan api dan bagaimana cara menampilkan nya ",
  "detail_my_team": "ini adalah salah satu project pertama yang saya dapat dari https://devchallenges.io/. di project ini saya belajar menggunakan css selector untuk membuat children ke 2 dan 5 sedikit berbeda dari yang lain ",
  "detail_tic_tac": "ini adalah project game tic-tac-to yang saya pelajari dari website official React js. disini saya sedikit memodifikasi menjadi beberapa file terpisah tidak seperti yang ada di tutorial dan dari project ini saya belajar bagaimana mengubungkan value lewat props antar component",
  "detail_multiselect" : "hasil project belajar TypeScript sederhana dengan tambahan fitur keyboard",
  "detail_store" : "project belajar TypeScript lebih dalam dengan membuat E-commerce yang terhubung dengan midtrans sebagai payment gateway dan juga terhubung dengan admin dashboard untuk mengatur konten dan Next.js sebagai framework-nya",
  "detail_admin" : "sebuah admin dashboard yang terhubung dengan project e-commerce sebelumnya untuk mengatur konten apa yang ingin ditampilkan, project ini menggunakan clerk sebagai auth dan prisma sebagai ORM dan tentu saja ada Api yang bisa di gunakan untuk membuat E-commerce sebagai front-end nya.",
  "detail_restfull" : "sebuah project RestFull API dengan java dan Springboot sebagai framework-nya, Postgre untuk database dan Junit untuk testing nya. Project ini menggunakan MVC sebagai desain arsitektur ",
  "detail_leet" : "Project ini saya buat untuk mengambil data dari leetcode yang ingin saya tampilkan di portofolio saya, waktu belajar untuk membuat project ini baru 1 hari jadi masih sangat sederhana",
  "aboutme": "Saya Yon, seorang web developer berusia 24 tahun yang tinggal di Blora. Meskipun lulus dari sekolah kejuruan di bidang Akuntansi, hasrat sejati saya adalah coding. Saya dikenal sebagai orang yang antusias dan rajin belajar secara mandiri, dan saya berkomitmen untuk membuat dampak yang signifikan dalam dunia pengembangan web.   ",
  "aboutme2": "Perjalanan saya ke dunia coding bukan hanya sebuah mimpi, ini adalah sebuah komitmen yang berdedikasi. Saya sangat percaya pada kekuatan keterampilan otodidak dan memiliki dedikasi yang tak tergoyahkan untuk memberikan kontribusi yang berarti pada bidang pengembangan web yang terus berkembang.",
  "contacme": "Untuk pertanyaan atau sekadar obrolan santai, jangan ragu untuk menghubungi Yon melalui informasi kontak yang tersedia di bawah ini.",
  "Role": " Peran",
  "Contact" : "Kontak Aku",
  "Welcome" : "Selamat Datang di Website Ku"
}
