{
  "detail_portofolio": "ini adalah project portofolio saya setelah belajar React js selama satu bulan, Tujuan saya membuat project ini adalah meng-test pengetahuan saya tentang React js yang sudah saya pelajari. Hooks yang saya pakai hanya useState, useEfffet, dan useInView dan dari project  ini saya belajar penggunaan useInView untuk membuat animasi saat elemen terlihat di layar dan library yang saya pakai daisy-ui untuk membuat sideBar",
  "detail_my_interior": "ini adalah salah satu project  pertama saya dapat dari https://devchallenges.io/. di project ini saya belajar menggunakan JavaScript untuk membuat sidebar ",
  "detail_not_found":  "ini adalah project pertama yang saya dapat dari https://devchallenges.io/. di project ini saya belajar pertama kali menggunakan html dan css untuk membuat tampilan website yang menarik ",
  "detail_quote": "ini adalah yang saya dapat dari https://www.freecodecamp.org/. di project ini saya belajar menggunakan api dan bagaimana cara menampilkan nya ",
  "detail_my_team": "ini adalah salah satu project pertama yang saya dapat dari https://devchallenges.io/. di project ini saya belajar menggunakan css selector untuk membuat children ke 2 dan 5 sedikit berbeda dari yang lain ",
  "detail_tic_tac": "ini adalah project game tic-tac-to yang saya pelajari dari website official React js. disini saya sedikit memodifikasi menjadi beberapa file terpisah tidak seperti yang ada di tutorial dan dari project ini saya belajar bagaimana mengubungkan value lewat props antar component",
  "detail_multiselect" : "hasil project belajar TypeScript sederhana dengan tambahan fitur keyboard",
  "detail_store" : "project belajar TypeScript lebih dalam dengan membuat E-commerce yang terhubung dengan midtrans sebagai payment gateway dan juga terhubung dengan admin dashboard untuk mengatur konten dan Next.js sebagai framework-nya",
  "detail_admin" : "sebuah admin dashboard yang terhubung dengan project e-commerce sebelumnya untuk mengatur konten apa yang ingin ditampilkan, project ini menggunakan clerk sebagai auth dan prisma sebagai ORM",
  "detail_restfull" : "sebuah project RestFull API dengan java dan Springboot sebagai framework-nya, Postgre untuk database dan Junit untuk testing nya",
  "aboutme": "Kenali Yon, seorang pengembang web berusia 24 tahun yang berbasis di Blora. Meskipun lulus dari sekolah kejuruan jurusan Akuntansi, Yon selalu memiliki hasrat yang mendalam terhadap coding. Dikenal karena semangat dan ketekunan dalam pembelajaran mandiri, Yon berkomitmen untuk memberikan dampak signifikan dalam dunia pengembangan web.  ",
  "aboutme2": "Perjalanan Yon dalam dunia coding bukan hanya sekadar impian, ini adalah komitmen sungguh-sungguh. Keyakinan Yon terhadap kekuatan keterampilan yang diperoleh secara mandiri dan dedikasi yang teguh mencerminkan keinginan kuat untuk memberikan kontribusi yang berarti dalam dunia pengembangan web yang selalu berkembang.",
  "contacme": "Untuk pertanyaan atau sekadar obrolan santai, jangan ragu untuk menghubungi Yon melalui informasi kontak yang tersedia di bawah ini.",
  "Role": " Peran",
  "Contact" : "Kontak Aku",
  "Welcome" : "Selamat Datang di Website Ku",
  "Magic": "Sihir",
  "Magic Sequence": "Rangkaian Sihir",
  "Witchcraft Archives": "Arsip Ilmu Sihir",
  "Weapons": "Senjata",
  "Other": "Lain-Lain",
  "JavaScript" : "Sihir JavaScript (JS) menghidupkan dunia pemrograman dengan kekuatan untuk menciptakan website yang tak hanya statis, melainkan juga interaktif dan dinamis. Dengan sihirnya, konten berdansa di depan layar, berubah dan bergerak tanpa memerlukan ritual mereload halaman.",
  "Tailwind" : "Tailwind CSS, sebagai Rangkian Sihir  , memberikan karakter pengembang kemampuan untuk mengubah tampilan elemen HTML dengan cepat dan akurat. Dengan mantra-mantra (utility classes) ajaib, mereka mampu menciptakan antarmuka pengguna yang memukau, seolah-olah setiap kelas utilitas adalah sihir yang dapat diaktifkan untuk membentuk desain sesuai keinginan karakter.",
  "React" : "React, sebagai tongkat ajaib JavaScript, mengilhami penciptaan antarmuka pengguna yang hidup, membangun fondasi yang interaktif berbasis komponen. Terlahir dari tangan-tangan mahir Facebook dan terwujud dalam bentuk open-source, React menyebarkan sihirnya ke seluruh penjuru dunia.",
  "Framer" : "Framer Motion, seolah menjadi alat animasi yang misterius di dunia JavaScript, menawarkan kekuatan sederhana namun luar biasa untuk React. Dengan kemampuannya yang ajaib, perpustakaan ini menciptakan gerakan halus dan keindahan yang mempesona di beranda web.",
  "Daisy" : "DaisyUI, seperti buku sihir terbuka di dunia desain, dirancang di atas TailwindCSS. Pustaka ini menampilkan kelas-kelas semantic pendek yang terfokus pada komponen, membentuk mantra-mantra ajaib yang terstruktur dari string kelas Tailwind yang lebih panjang.",
  "Vscode" : "VSCode adalah senjata yang tangkas dan mematikan di medan pertempuran kode. Dengan pedangnya yang tajam, para penyihir kode dapat melibas melalui baris-baris kodifikasi, menciptakan mantra-mantra (kode) yang kuat dan efisien. Dalam persaingan dengan alat-alat sejenis, VSCode adalah senjata pilihan yang memberikan kekuatan dan ketangkasan kepada para penyihir kode dalam menciptakan dunia-dunia digital yang menakjubkan.",
  "Figma" : "Figma adalah buku desain ajaib yang memungkinkan para penyihir desain untuk merancang dan memvisualisasikan elemen-elemen visual dengan keleluasaan dan ketelitian yang luar biasa. Sebagai platform kolaboratif, Figma memungkinkan tim penyihir desain untuk bersama-sama menghadirkan kehidupan pada konsep-konsep kreatif, seolah-olah setiap elemen visual adalah sihir yang dapat diakses dan diubah oleh seluruh tim.",
  "Html" : "HTML5 adalah naskah sihir digital yang memberikan pedoman untuk merancang dan membangun dunia web. Sebagai standar terkini dari HTML, ia membawa elemen-elemen baru dan kemampuan yang mengaktifkan penciptaan halaman web yang lebih dinamis, interaktif, dan responsif.",
  "Css" : "CSS3 adalah perisai gaya bagi dunia web, memberikan kemampuan untuk mempercantik dan memberikan identitas pada elemen-elemen HTML. Sebagai evolusi dari CSS, versi ini membawa sejumlah fitur baru, seperti animasi, transisi, dan efek visual lainnya, yang menjadikannya senjata yang kuat bagi para penyihir desain untuk membangun tampilan yang indah dan dinamis di medan pertempuran desain web.",
  "Scss" : "SCSS adalah pakaian perisai ajaib yang memungkinkan para penyihir desain untuk menciptakan gaya dan tata letak dengan lebih efisien dalam dunia web. Sebagai ekstensi dari CSS dengan fitur-fitur seperti variabel, mixin, dan nesting, SCSS memberikan kemampuan sihir kepada para pengembang untuk merancang dan mengelola gaya dengan lebih efektif, seolah-olah setiap elemen HTML mengenakan pakaian sihir yang unik dan efisien.",
  "Git" : "Git adalah buku catatan sihir yang memungkinkan para penyihir pengembangan perangkat lunak untuk melacak, menyimpan, dan berkolaborasi dalam penciptaan mantra (kode) dengan keakuratan dan ketelitian luar biasa. Sebagai sistem kontrol versi, Git memastikan bahwa setiap aksi sihir di dunia pengembangan perangkat lunak dicatat dan dapat diakses, memungkinkan tim penyihir untuk bekerja bersama-sama dan menjaga keharmonisan dalam pengembangan proyek mereka.",
  "Rest" : "REST API adalah pintu gerbang teleportasi yang memungkinkan para penyihir kode untuk mentransfer dan berbagi kekuatan sihir (data) di seluruh dunia digital. Sebagai antarmuka yang menyediakan akses terstruktur, REST API memungkinkan penyihir kode untuk berkomunikasi dengan elemen-elemen lain dalam dunia pengembangan perangkat lunak, memungkinkan pertukaran informasi dan kolaborasi antar sistem."
}
